Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_usb.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; stm32H743_usb.
; ==============

;------------------------------------------------------------------------
; Author:   Edo. Franzi
; Modifs:   Laurent von Allmen
;
; Project:  uKOS-X
; Goal:     stm32H743_usb equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// USB_OTG_Core_register
// ---------------------

typedef struct {
    volatile    uint32_t    GOTGCTL;
    volatile    uint32_t    GOTGINT;
    volatile    uint32_t    GAHBCFG;
    volatile    uint32_t    GUSBCFG;
    volatile    uint32_t    GRSTCTL;
    volatile    uint32_t    GINTSTS;
    volatile    uint32_t    GINTMSK;
    volatile    uint32_t    GRXSTSR;
    volatile    uint32_t    GRXSTSP;
    volatile    uint32_t    GRXFSIZ;
    volatile    uint32_t    DIEPTXF0_HNPTXFSIZ;
    volatile    uint32_t    HNPTXSTS;
    volatile    uint32_t    Reserved30[2];
    volatile    uint32_t    GCCFG;
    volatile    uint32_t    CID;
    volatile    uint32_t    GSNPSID;
    volatile    uint32_t    GHWCFG1;
    volatile    uint32_t    GHWCFG2;
    volatile    uint32_t    GHWCFG3;
    volatile    uint32_t    Reserved6;
    volatile    uint32_t    GLPMCFG;
    volatile    uint32_t    GPWRDN;
    volatile    uint32_t    GDFIFOCFG;
    volatile    uint32_t    GADPCTL;
    volatile    uint32_t    Reserved43[39];
    volatile    uint32_t    HPTXFSIZ;
    volatile    uint32_t    DIEPTXF[0x0F];
} USB_OTG_GlobalTypeDef;

// USB_OTG_device_Registers
// ------------------------

typedef struct {
    volatile    uint32_t    DCFG;
    volatile    uint32_t    DCTL;
    volatile    uint32_t    DSTS;
    volatile    uint32_t    Reserved0C;
    volatile    uint32_t    DIEPMSK;
    volatile    uint32_t    DOEPMSK;
    volatile    uint32_t    DAINT;
    volatile    uint32_t    DAINTMSK;
    volatile    uint32_t    Reserved20;
    volatile    uint32_t    Reserved24;
    volatile    uint32_t    DVBUSDIS;
    volatile    uint32_t    DVBUSPULSE;
    volatile    uint32_t    DTHRCTL;
    volatile    uint32_t    DIEPEMPMSK;
    volatile    uint32_t    DEACHINT;
    volatile    uint32_t    DEACHMSK;
    volatile    uint32_t    Reserved40;
    volatile    uint32_t    DINEP1MSK;
    volatile    uint32_t    Reserved44[15];
    volatile    uint32_t    DOUTEP1MSK;
} USB_OTG_DeviceTypeDef;

// USB_OTG_IN_Endpoint-Specific_Register
// -------------------------------------

typedef struct {
    volatile    uint32_t    DIEPCTL;
    volatile    uint32_t    Reserved04;
    volatile    uint32_t    DIEPINT;
    volatile    uint32_t    Reserved0C;
    volatile    uint32_t    DIEPTSIZ;
    volatile    uint32_t    DIEPDMA;
    volatile    uint32_t    DTXFSTS;
    volatile    uint32_t    Reserved18;
} USB_OTG_INEndpointTypeDef;

// USB_OTG_OUT_Endpoint-Specific_Registers
// ---------------------------------------

typedef struct {
    volatile    uint32_t    DOEPCTL;
    volatile    uint32_t    Reserved04;
    volatile    uint32_t    DOEPINT;
    volatile    uint32_t    Reserved0C;
    volatile    uint32_t    DOEPTSIZ;
    volatile    uint32_t    DOEPDMA;
    volatile    uint32_t    Reserved18[2];
} USB_OTG_OUTEndpointTypeDef;

// USB_OTG_Host_Mode_Register_Structures
// -------------------------------------

typedef struct {
    volatile    uint32_t    HCFG;
    volatile    uint32_t    HFIR;
    volatile    uint32_t    HFNUM;
    volatile    uint32_t    Reserved40C;
    volatile    uint32_t    HPTXSTS;
    volatile    uint32_t    HAINT;
    volatile    uint32_t    HAINTMSK;
} USB_OTG_HostTypeDef;

// USB_OTG_Host_Channel_Specific_Registers
// ---------------------------------------

typedef struct {
    volatile    uint32_t    HCCHAR;
    volatile    uint32_t    HCSPLT;
    volatile    uint32_t    HCINT;
    volatile    uint32_t    HCINTMSK;
    volatile    uint32_t    HCTSIZ;
    volatile    uint32_t    HCDMA;
    volatile    uint32_t    Reserved[2];
} USB_OTG_HostChannelTypeDef;

#define USB1_OTG_HS ((USB_OTG_GlobalTypeDef *)USB1_OTG_HS_PERIPH_BASE)
#define USB2_OTG_FS ((USB_OTG_GlobalTypeDef *)USB2_OTG_FS_PERIPH_BASE)

#define USB_OTG_HS                          USB1_OTG_HS
#define USB_OTG_HS_PERIPH_BASE              USB1_OTG_HS_PERIPH_BASE
#define USB_OTG_FS                          USB2_OTG_FS
#define USB_OTG_FS_PERIPH_BASE              USB2_OTG_FS_PERIPH_BASE

// USB_OTG_GOTGCTL register

#define USB_OTG_GOTGCTL_SRQSCS              0x00000001U
#define USB_OTG_GOTGCTL_SRQ                 0x00000002U
#define USB_OTG_GOTGCTL_VBVALOEN            0x00000004U
#define USB_OTG_GOTGCTL_VBVALOVAL           0x00000008U
#define USB_OTG_GOTGCTL_AVALOEN             0x00000010U
#define USB_OTG_GOTGCTL_AVALOVAL            0x00000020U
#define USB_OTG_GOTGCTL_BVALOEN             0x00000040U
#define USB_OTG_GOTGCTL_BVALOVAL            0x00000080U
#define USB_OTG_GOTGCTL_HNGSCS              0x00000100U
#define USB_OTG_GOTGCTL_HNPRQ               0x00000200U
#define USB_OTG_GOTGCTL_HSHNPEN             0x00000400U
#define USB_OTG_GOTGCTL_DHNPEN              0x00000800U
#define USB_OTG_GOTGCTL_EHEN                0x00001000U
#define USB_OTG_GOTGCTL_CIDSTS              0x00010000U
#define USB_OTG_GOTGCTL_DBCT                0x00020000U
#define USB_OTG_GOTGCTL_ASVLD               0x00040000U
#define USB_OTG_GOTGCTL_BSESVLD             0x00080000U
#define USB_OTG_GOTGCTL_OTGVER              0x00100000U

// USB_OTG_HCFG register

#define USB_OTG_HCFG_FSLSPCS                0x00000003U
#define USB_OTG_HCFG_FSLSPCS_0              0x00000001U
#define USB_OTG_HCFG_FSLSPCS_1              0x00000002U
#define USB_OTG_HCFG_FSLSS                  0x00000004U

// USB_OTG_DCFG register

#define USB_OTG_DCFG_DSPD                   0x00000003U
#define USB_OTG_DCFG_DSPD_0                 0x00000001U
#define USB_OTG_DCFG_DSPD_1                 0x00000002U
#define USB_OTG_DCFG_NZLSOHSK               0x00000004U
#define USB_OTG_DCFG_DAD                    0x000007F0U
#define USB_OTG_DCFG_DAD_0                  0x00000010U
#define USB_OTG_DCFG_DAD_1                  0x00000020U
#define USB_OTG_DCFG_DAD_2                  0x00000040U
#define USB_OTG_DCFG_DAD_3                  0x00000080U
#define USB_OTG_DCFG_DAD_4                  0x00000100U
#define USB_OTG_DCFG_DAD_5                  0x00000200U
#define USB_OTG_DCFG_DAD_6                  0x00000400U
#define USB_OTG_DCFG_PFIVL                  0x00001800U
#define USB_OTG_DCFG_PFIVL_0                0x00000800U
#define USB_OTG_DCFG_PFIVL_1                0x00001000U
#define USB_OTG_DCFG_PERSCHIVL              0x03000000U
#define USB_OTG_DCFG_PERSCHIVL_0            0x01000000U
#define USB_OTG_DCFG_PERSCHIVL_1            0x02000000U

// USB_OTG_PCGCR register

#define USB_OTG_PCGCR_STPPCLK               0x00000001U
#define USB_OTG_PCGCR_GATEHCLK              0x00000002U
#define USB_OTG_PCGCR_PHYSUSP               0x00000010U

// USB_OTG_GOTGINT register

