Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_usb.h
#define USB_OTG_GOTGINT_SEDET               0x00000004U
#define USB_OTG_GOTGINT_SRSSCHG             0x00000100U
#define USB_OTG_GOTGINT_HNSSCHG             0x00000200U
#define USB_OTG_GOTGINT_HNGDET              0x00020000U
#define USB_OTG_GOTGINT_ADTOCHG             0x00040000U
#define USB_OTG_GOTGINT_DBCDNE              0x00080000U

// USB_OTG_DCTL register

#define USB_OTG_DCTL_RWUSIG                 0x00000001U
#define USB_OTG_DCTL_SDIS                   0x00000002U
#define USB_OTG_DCTL_GINSTS                 0x00000004U
#define USB_OTG_DCTL_GONSTS                 0x00000008U
#define USB_OTG_DCTL_TCTL                   0x00000070U
#define USB_OTG_DCTL_TCTL_0                 0x00000010U
#define USB_OTG_DCTL_TCTL_1                 0x00000020U
#define USB_OTG_DCTL_TCTL_2                 0x00000040U
#define USB_OTG_DCTL_SGINAK                 0x00000080U
#define USB_OTG_DCTL_CGINAK                 0x00000100U
#define USB_OTG_DCTL_SGONAK                 0x00000200U
#define USB_OTG_DCTL_CGONAK                 0x00000400U
#define USB_OTG_DCTL_POPRGDNE               0x00000800U

// USB_OTG_HFIR register

#define USB_OTG_HFIR_FRIVL                  0x0000FFFFU

// USB_OTG_HFNUM register

#define USB_OTG_HFNUM_FRNUM                 0x0000FFFFU
#define USB_OTG_HFNUM_FTREM                 0xFFFF0000U

// USB_OTG_DSTS register

#define USB_OTG_DSTS_SUSPSTS                0x00000001U
#define USB_OTG_DSTS_ENUMSPD                0x00000006U
#define USB_OTG_DSTS_ENUMSPD_0              0x00000002U
#define USB_OTG_DSTS_ENUMSPD_1              0x00000004U
#define USB_OTG_DSTS_EERR                   0x00000008U
#define USB_OTG_DSTS_FNSOF                  0x003FFF00U

// USB_OTG_GAHBCFG register

#define USB_OTG_GAHBCFG_GINT                0x00000001U
#define USB_OTG_GAHBCFG_HBSTLEN             0x0000001EU
#define USB_OTG_GAHBCFG_DMAEN               0x00000020U
#define USB_OTG_GAHBCFG_TXFELVL             0x00000080U
#define USB_OTG_GAHBCFG_PTXFELVL            0x00000100U

// USB_OTG_GUSBCFG register

#define USB_OTG_GUSBCFG_TOCAL               0x00000007U
#define USB_OTG_GUSBCFG_TOCAL_0             0x00000001U
#define USB_OTG_GUSBCFG_TOCAL_1             0x00000002U
#define USB_OTG_GUSBCFG_TOCAL_2             0x00000004U
#define USB_OTG_GUSBCFG_PHYSEL              0x00000040U
#define USB_OTG_GUSBCFG_SRPCAP              0x00000100U
#define USB_OTG_GUSBCFG_HNPCAP              0x00000200U
#define USB_OTG_GUSBCFG_TRDT                0x00003C00U
#define USB_OTG_GUSBCFG_TRDT_0              0x00000400U
#define USB_OTG_GUSBCFG_TRDT_1              0x00000800U
#define USB_OTG_GUSBCFG_TRDT_2              0x00001000U
#define USB_OTG_GUSBCFG_TRDT_3              0x00002000U
#define USB_OTG_GUSBCFG_PHYLPCS             0x00008000U
#define USB_OTG_GUSBCFG_ULPIFSLS            0x00020000U
#define USB_OTG_GUSBCFG_ULPIAR              0x00040000U
#define USB_OTG_GUSBCFG_ULPICSM             0x00080000U
#define USB_OTG_GUSBCFG_ULPIEVBUSD          0x00100000U
#define USB_OTG_GUSBCFG_ULPIEVBUSI          0x00200000U
#define USB_OTG_GUSBCFG_TSDPS               0x00400000U
#define USB_OTG_GUSBCFG_PCCI                0x00800000U
#define USB_OTG_GUSBCFG_PTCI                0x01000000U
#define USB_OTG_GUSBCFG_ULPIIPD             0x02000000U
#define USB_OTG_GUSBCFG_FHMOD               0x20000000U
#define USB_OTG_GUSBCFG_FDMOD               0x40000000U
#define USB_OTG_GUSBCFG_CTXPKT              0x80000000U

// USB_OTG_GRSTCTL register

#define USB_OTG_GRSTCTL_CSRST               0x00000001U
#define USB_OTG_GRSTCTL_HSRST               0x00000002U
#define USB_OTG_GRSTCTL_FCRST               0x00000004U
#define USB_OTG_GRSTCTL_RXFFLSH             0x00000010U
#define USB_OTG_GRSTCTL_TXFFLSH             0x00000020U
#define USB_OTG_GRSTCTL_TXFNUM              0x000007C0U
#define USB_OTG_GRSTCTL_TXFNUM_0            0x00000040U
#define USB_OTG_GRSTCTL_TXFNUM_1            0x00000080U
#define USB_OTG_GRSTCTL_TXFNUM_2            0x00000100U
#define USB_OTG_GRSTCTL_TXFNUM_3            0x00000200U
#define USB_OTG_GRSTCTL_TXFNUM_4            0x00000400U
#define USB_OTG_GRSTCTL_DMAREQ              0x40000000U
#define USB_OTG_GRSTCTL_AHBIDL              0x80000000U

// USB_OTG_DIEPMSK register

#define USB_OTG_DIEPMSK_XFRCM               0x00000001U
#define USB_OTG_DIEPMSK_EPDM                0x00000002U
#define USB_OTG_DIEPMSK_TOM                 0x00000008U
#define USB_OTG_DIEPMSK_ITTXFEMSK           0x00000010U
#define USB_OTG_DIEPMSK_INEPNMM             0x00000020U
#define USB_OTG_DIEPMSK_INEPNEM             0x00000040U
#define USB_OTG_DIEPMSK_TXFURM              0x00000100U
#define USB_OTG_DIEPMSK_BIM                 0x00000200U

// USB_OTG_HPTXSTS register

#define USB_OTG_HPTXSTS_PTXFSAVL            0x0000FFFFU
#define USB_OTG_HPTXSTS_PTXQSAV             0x00FF0000U
#define USB_OTG_HPTXSTS_PTXQSAV_0           0x00010000U
#define USB_OTG_HPTXSTS_PTXQSAV_1           0x00020000U
#define USB_OTG_HPTXSTS_PTXQSAV_2           0x00040000U
#define USB_OTG_HPTXSTS_PTXQSAV_3           0x00080000U
#define USB_OTG_HPTXSTS_PTXQSAV_4           0x00100000U
#define USB_OTG_HPTXSTS_PTXQSAV_5           0x00200000U
#define USB_OTG_HPTXSTS_PTXQSAV_6           0x00400000U
#define USB_OTG_HPTXSTS_PTXQSAV_7           0x00800000U
#define USB_OTG_HPTXSTS_PTXQTOP             0xFF000000U
#define USB_OTG_HPTXSTS_PTXQTOP_0           0x01000000U
#define USB_OTG_HPTXSTS_PTXQTOP_1           0x02000000U
#define USB_OTG_HPTXSTS_PTXQTOP_2           0x04000000U
#define USB_OTG_HPTXSTS_PTXQTOP_3           0x08000000U
#define USB_OTG_HPTXSTS_PTXQTOP_4           0x10000000U
#define USB_OTG_HPTXSTS_PTXQTOP_5           0x20000000U
#define USB_OTG_HPTXSTS_PTXQTOP_6           0x40000000U
#define USB_OTG_HPTXSTS_PTXQTOP_7           0x80000000U

// USB_OTG_HAINT register

#define USB_OTG_HAINT_HAINT                 0x0000FFFFU

// USB_OTG_DOEPMSK register

#define USB_OTG_DOEPMSK_XFRCM               0x00000001U
#define USB_OTG_DOEPMSK_EPDM                0x00000002U
#define USB_OTG_DOEPMSK_AHBERRM             0x00000004U
#define USB_OTG_DOEPMSK_STUPM               0x00000008U
#define USB_OTG_DOEPMSK_OTEPDM              0x00000010U
#define USB_OTG_DOEPMSK_OTEPSPRM            0x00000020U
#define USB_OTG_DOEPMSK_B2BSTUP             0x00000040U
#define USB_OTG_DOEPMSK_OPEM                0x00000100U
#define USB_OTG_DOEPMSK_BOIM                0x00000200U
#define USB_OTG_DOEPMSK_BERRM               0x00001000U
#define USB_OTG_DOEPMSK_NAKM                0x00002000U
#define USB_OTG_DOEPMSK_NYETM               0x00004000U

