Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_usb.h
// USB_OTG_GINTSTS register

#define USB_OTG_GINTSTS_CMOD                0x00000001U
#define USB_OTG_GINTSTS_MMIS                0x00000002U
#define USB_OTG_GINTSTS_OTGINT              0x00000004U
#define USB_OTG_GINTSTS_SOF                 0x00000008U
#define USB_OTG_GINTSTS_RXFLVL              0x00000010U
#define USB_OTG_GINTSTS_NPTXFE              0x00000020U
#define USB_OTG_GINTSTS_GINAKEFF            0x00000040U
#define USB_OTG_GINTSTS_BOUTNAKEFF          0x00000080U
#define USB_OTG_GINTSTS_ESUSP               0x00000400U
#define USB_OTG_GINTSTS_USBSUSP             0x00000800U
#define USB_OTG_GINTSTS_USBRST              0x00001000U
#define USB_OTG_GINTSTS_ENUMDNE             0x00002000U
#define USB_OTG_GINTSTS_ISOODRP             0x00004000U
#define USB_OTG_GINTSTS_EOPF                0x00008000U
#define USB_OTG_GINTSTS_IEPINT              0x00040000U
#define USB_OTG_GINTSTS_OEPINT              0x00080000U
#define USB_OTG_GINTSTS_IISOIXFR            0x00100000U
#define USB_OTG_GINTSTS_PXFR_INCOMPISOOUT   0x00200000U
#define USB_OTG_GINTSTS_DATAFSUSP           0x00400000U
#define USB_OTG_GINTSTS_RSTDET              0x00800000U
#define USB_OTG_GINTSTS_HPRTINT             0x01000000U
#define USB_OTG_GINTSTS_HCINT               0x02000000U
#define USB_OTG_GINTSTS_PTXFE               0x04000000U
#define USB_OTG_GINTSTS_LPMINT              0x08000000U
#define USB_OTG_GINTSTS_CIDSCHG             0x10000000U
#define USB_OTG_GINTSTS_DISCINT             0x20000000U
#define USB_OTG_GINTSTS_SRQINT              0x40000000U
#define USB_OTG_GINTSTS_WKUINT              0x80000000U

// USB_OTG_GINTMSK register

#define USB_OTG_GINTMSK_MMISM               0x00000002U
#define USB_OTG_GINTMSK_OTGINT              0x00000004U
#define USB_OTG_GINTMSK_SOFM                0x00000008U
#define USB_OTG_GINTMSK_RXFLVLM             0x00000010U
#define USB_OTG_GINTMSK_NPTXFEM             0x00000020U
#define USB_OTG_GINTMSK_GINAKEFFM           0x00000040U
#define USB_OTG_GINTMSK_GONAKEFFM           0x00000080U
#define USB_OTG_GINTMSK_ESUSPM              0x00000400U
#define USB_OTG_GINTMSK_USBSUSPM            0x00000800U
#define USB_OTG_GINTMSK_USBRST              0x00001000U
#define USB_OTG_GINTMSK_ENUMDNEM            0x00002000U
#define USB_OTG_GINTMSK_ISOODRPM            0x00004000U
#define USB_OTG_GINTMSK_EOPFM               0x00008000U
#define USB_OTG_GINTMSK_EPMISM              0x00020000U
#define USB_OTG_GINTMSK_IEPINT              0x00040000U
#define USB_OTG_GINTMSK_OEPINT              0x00080000U
#define USB_OTG_GINTMSK_IISOIXFRM           0x00100000U
#define USB_OTG_GINTMSK_PXFRM_IISOOXFRM     0x00200000U
#define USB_OTG_GINTMSK_FSUSPM              0x00400000U
#define USB_OTG_GINTMSK_RSTDEM              0x00800000U
#define USB_OTG_GINTMSK_PRTIM               0x01000000U
#define USB_OTG_GINTMSK_HCIM                0x02000000U
#define USB_OTG_GINTMSK_PTXFEM              0x04000000U
#define USB_OTG_GINTMSK_LPMINTM             0x08000000U
#define USB_OTG_GINTMSK_CIDSCHGM            0x10000000U
#define USB_OTG_GINTMSK_DISCINT             0x20000000U
#define USB_OTG_GINTMSK_SRQIM               0x40000000U
#define USB_OTG_GINTMSK_WUIM                0x80000000U

// USB_OTG_DAINT register

#define USB_OTG_DAINT_IEPINT                0x0000FFFFU
#define USB_OTG_DAINT_OEPINT                0xFFFF0000U

// USB_OTG_HAINTMSK register

#define USB_OTG_HAINTMSK_HAINTM             0x0000FFFFU

// USB_OTG_GRXSTSP register

#define USB_OTG_GRXSTSP_EPNUM               0x0000000FU
#define USB_OTG_GRXSTSP_BCNT                0x00007FF0U
#define USB_OTG_GRXSTSP_DPID                0x00018000U
#define USB_OTG_GRXSTSP_PKTSTS              0x001E0000U

// USB_OTG_DAINTMSK register

#define USB_OTG_DAINTMSK_IEPM               0x0000FFFFU
#define USB_OTG_DAINTMSK_OEPM               0xFFFF0000U

// OTG register

#define USB_OTG_CHNUM                       0x0000000FU
#define USB_OTG_CHNUM_0                     0x00000001U
#define USB_OTG_CHNUM_1                     0x00000002U
#define USB_OTG_CHNUM_2                     0x00000004U
#define USB_OTG_CHNUM_3                     0x00000008U
#define USB_OTG_BCNT                        0x00007FF0U
#define USB_OTG_DPID                        0x00018000U
#define USB_OTG_DPID_0                      0x00008000U
#define USB_OTG_DPID_1                      0x00010000U
#define USB_OTG_PKTSTS                      0x001E0000U
#define USB_OTG_PKTSTS_0                    0x00020000U
#define USB_OTG_PKTSTS_1                    0x00040000U
#define USB_OTG_PKTSTS_2                    0x00080000U
#define USB_OTG_PKTSTS_3                    0x00100000U
#define USB_OTG_EPNUM                       0x0000000FU
#define USB_OTG_EPNUM_0                     0x00000001U
#define USB_OTG_EPNUM_1                     0x00000002U
#define USB_OTG_EPNUM_2                     0x00000004U
#define USB_OTG_EPNUM_3                     0x00000008U
#define USB_OTG_FRMNUM                      0x01E00000U
#define USB_OTG_FRMNUM_0                    0x00200000U
#define USB_OTG_FRMNUM_1                    0x00400000U
#define USB_OTG_FRMNUM_2                    0x00800000U
#define USB_OTG_FRMNUM_3                    0x01000000U

// USB_OTG_GRXFSIZ register

#define USB_OTG_GRXFSIZ_RXFD                0x0000FFFFU

// USB_OTG_DVBUSDIS register

#define USB_OTG_DVBUSDIS_VBUSDT             0x0000FFFFU

// OTG register

#define USB_OTG_NPTXFSA                     0x0000FFFFU
#define USB_OTG_NPTXFD                      0xFFFF0000U
#define USB_OTG_TX0FSA                      0x0000FFFFU
#define USB_OTG_TX0FD                       0xFFFF0000U

// USB_OTG_DVBUSPULSE register

#define USB_OTG_DVBUSPULSE_DVBUSP           0x00000FFFU

// USB_OTG_GNPTXSTS register

#define USB_OTG_GNPTXSTS_NPTXFSAV           0x0000FFFFU
#define USB_OTG_GNPTXSTS_NPTQXSAV           0x00FF0000U
#define USB_OTG_GNPTXSTS_NPTQXSAV_0         0x00010000U
#define USB_OTG_GNPTXSTS_NPTQXSAV_1         0x00020000U
#define USB_OTG_GNPTXSTS_NPTQXSAV_2         0x00040000U
#define USB_OTG_GNPTXSTS_NPTQXSAV_3         0x00080000U
#define USB_OTG_GNPTXSTS_NPTQXSAV_4         0x00100000U
#define USB_OTG_GNPTXSTS_NPTQXSAV_5         0x00200000U
#define USB_OTG_GNPTXSTS_NPTQXSAV_6         0x00400000U
#define USB_OTG_GNPTXSTS_NPTQXSAV_7         0x00800000U
#define USB_OTG_GNPTXSTS_NPTXQTOP           0x7F000000U
#define USB_OTG_GNPTXSTS_NPTXQTOP_0         0x01000000U
#define USB_OTG_GNPTXSTS_NPTXQTOP_1         0x02000000U
#define USB_OTG_GNPTXSTS_NPTXQTOP_2         0x04000000U
#define USB_OTG_GNPTXSTS_NPTXQTOP_3         0x08000000U
#define USB_OTG_GNPTXSTS_NPTXQTOP_4         0x10000000U
#define USB_OTG_GNPTXSTS_NPTXQTOP_5         0x20000000U
#define USB_OTG_GNPTXSTS_NPTXQTOP_6         0x40000000U

// USB_OTG_DTHRCTL register

