Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_usb.h
#define USB_OTG_DTHRCTL_NONISOTHREN         0x00000001U
#define USB_OTG_DTHRCTL_ISOTHREN            0x00000002U
#define USB_OTG_DTHRCTL_TXTHRLEN            0x000007FCU
#define USB_OTG_DTHRCTL_TXTHRLEN_0          0x00000004U
#define USB_OTG_DTHRCTL_TXTHRLEN_1          0x00000008U
#define USB_OTG_DTHRCTL_TXTHRLEN_2          0x00000010U
#define USB_OTG_DTHRCTL_TXTHRLEN_3          0x00000020U
#define USB_OTG_DTHRCTL_TXTHRLEN_4          0x00000040U
#define USB_OTG_DTHRCTL_TXTHRLEN_5          0x00000080U
#define USB_OTG_DTHRCTL_TXTHRLEN_6          0x00000100U
#define USB_OTG_DTHRCTL_TXTHRLEN_7          0x00000200U
#define USB_OTG_DTHRCTL_TXTHRLEN_8          0x00000400U
#define USB_OTG_DTHRCTL_RXTHREN             0x00010000U
#define USB_OTG_DTHRCTL_RXTHRLEN            0x03FE0000U
#define USB_OTG_DTHRCTL_RXTHRLEN_0          0x00020000U
#define USB_OTG_DTHRCTL_RXTHRLEN_1          0x00040000U
#define USB_OTG_DTHRCTL_RXTHRLEN_2          0x00080000U
#define USB_OTG_DTHRCTL_RXTHRLEN_3          0x00100000U
#define USB_OTG_DTHRCTL_RXTHRLEN_4          0x00200000U
#define USB_OTG_DTHRCTL_RXTHRLEN_5          0x00400000U
#define USB_OTG_DTHRCTL_RXTHRLEN_6          0x00800000U
#define USB_OTG_DTHRCTL_RXTHRLEN_7          0x01000000U
#define USB_OTG_DTHRCTL_RXTHRLEN_8          0x02000000U
#define USB_OTG_DTHRCTL_ARPEN               0x08000000U

// USB_OTG_DIEPEMPMSK register

#define USB_OTG_DIEPEMPMSK_INEPTXFEM        0x0000FFFFU

// USB_OTG_DEACHINT register

#define USB_OTG_DEACHINT_IEP1INT            0x00000002U
#define USB_OTG_DEACHINT_OEP1INT            0x00020000U

// USB_OTG_GCCFG register

#define USB_OTG_GCCFG_DCDET                 0x00000001U
#define USB_OTG_GCCFG_PDET                  0x00000002U
#define USB_OTG_GCCFG_SDET                  0x00000004U
#define USB_OTG_GCCFG_PS2DET                0x00000008U
#define USB_OTG_GCCFG_PWRDWN                0x00010000U
#define USB_OTG_GCCFG_BCDEN                 0x00020000U
#define USB_OTG_GCCFG_DCDEN                 0x00040000U
#define USB_OTG_GCCFG_PDEN                  0x00080000U
#define USB_OTG_GCCFG_SDEN                  0x00100000U

#define USB_OTG_GCCFG_VBDEN                 0x00200000U

// USB_OTG_GPWRDN) register

#define USB_OTG_GPWRDN_ADPMEN               0x00000001U
#define USB_OTG_GPWRDN_ADPIF                0x00800000U

// USB_OTG_DEACHINTMSK register

#define USB_OTG_DEACHINTMSK_IEP1INTM        0x00000002U
#define USB_OTG_DEACHINTMSK_OEP1INTM        0x00020000U

// USB_OTG_CID register

#define USB_OTG_CID_PRODUCT_ID              0xFFFFFFFFU

// USB_OTG_GLPMCFG register

#define USB_OTG_GLPMCFG_LPMEN               0x00000001U
#define USB_OTG_GLPMCFG_LPMACK              0x00000002U
#define USB_OTG_GLPMCFG_BESL                0x0000003CU
#define USB_OTG_GLPMCFG_REMWAKE             0x00000040U
#define USB_OTG_GLPMCFG_L1SSEN              0x00000080U
#define USB_OTG_GLPMCFG_BESLTHRS            0x00000F00U
#define USB_OTG_GLPMCFG_L1DSEN              0x00001000U
#define USB_OTG_GLPMCFG_LPMRSP              0x00006000U
#define USB_OTG_GLPMCFG_SLPSTS              0x00008000U
#define USB_OTG_GLPMCFG_L1RSMOK             0x00010000U
#define USB_OTG_GLPMCFG_LPMCHIDX            0x001E0000U
#define USB_OTG_GLPMCFG_LPMRCNT             0x00E00000U
#define USB_OTG_GLPMCFG_SNDLPM              0x01000000U
#define USB_OTG_GLPMCFG_LPMRCNTSTS          0x0E000000U
#define USB_OTG_GLPMCFG_ENBESL              0x10000000U

// USB_OTG_DIEPEACHMSK1 register

#define USB_OTG_DIEPEACHMSK1_XFRCM          0x00000001U
#define USB_OTG_DIEPEACHMSK1_EPDM           0x00000002U
#define USB_OTG_DIEPEACHMSK1_TOM            0x00000008U
#define USB_OTG_DIEPEACHMSK1_ITTXFEMSK      0x00000010U
#define USB_OTG_DIEPEACHMSK1_INEPNMM        0x00000020U
#define USB_OTG_DIEPEACHMSK1_INEPNEM        0x00000040U
#define USB_OTG_DIEPEACHMSK1_TXFURM         0x00000100U
#define USB_OTG_DIEPEACHMSK1_BIM            0x00000200U
#define USB_OTG_DIEPEACHMSK1_NAKM           0x00002000U

// USB_OTG_HPRT register

#define USB_OTG_HPRT_PCSTS                  0x00000001U
#define USB_OTG_HPRT_PCDET                  0x00000002U
#define USB_OTG_HPRT_PENA                   0x00000004U
#define USB_OTG_HPRT_PENCHNG                0x00000008U
#define USB_OTG_HPRT_POCA                   0x00000010U
#define USB_OTG_HPRT_POCCHNG                0x00000020U
#define USB_OTG_HPRT_PRES                   0x00000040U
#define USB_OTG_HPRT_PSUSP                  0x00000080U
#define USB_OTG_HPRT_PRST                   0x00000100U
#define USB_OTG_HPRT_PLSTS                  0x00000C00U
#define USB_OTG_HPRT_PLSTS_0                0x00000400U
#define USB_OTG_HPRT_PLSTS_1                0x00000800U
#define USB_OTG_HPRT_PPWR                   0x00001000U
#define USB_OTG_HPRT_PTCTL                  0x0001E000U
#define USB_OTG_HPRT_PTCTL_0                0x00002000U
#define USB_OTG_HPRT_PTCTL_1                0x00004000U
#define USB_OTG_HPRT_PTCTL_2                0x00008000U
#define USB_OTG_HPRT_PTCTL_3                0x00010000U
#define USB_OTG_HPRT_PSPD                   0x00060000U
#define USB_OTG_HPRT_PSPD_0                 0x00020000U
#define USB_OTG_HPRT_PSPD_1                 0x00040000U

// USB_OTG_DOEPEACHMSK1 register

#define USB_OTG_DOEPEACHMSK1_XFRCM          0x00000001U
#define USB_OTG_DOEPEACHMSK1_EPDM           0x00000002U
#define USB_OTG_DOEPEACHMSK1_TOM            0x00000008U
#define USB_OTG_DOEPEACHMSK1_ITTXFEMSK      0x00000010U
#define USB_OTG_DOEPEACHMSK1_INEPNMM        0x00000020U
#define USB_OTG_DOEPEACHMSK1_INEPNEM        0x00000040U
#define USB_OTG_DOEPEACHMSK1_TXFURM         0x00000100U
#define USB_OTG_DOEPEACHMSK1_BIM            0x00000200U
#define USB_OTG_DOEPEACHMSK1_BERRM          0x00001000U
#define USB_OTG_DOEPEACHMSK1_NAKM           0x00002000U
#define USB_OTG_DOEPEACHMSK1_NYETM          0x00004000U

// USB_OTG_HPTXFSIZ register

#define USB_OTG_HPTXFSIZ_PTXSA              0x0000FFFFU
#define USB_OTG_HPTXFSIZ_PTXFD              0xFFFF0000U

// USB_OTG_DIEPCTL register

#define USB_OTG_DIEPCTL_MPSIZ               0x000007FFU
#define USB_OTG_DIEPCTL_USBAEP              0x00008000U
#define USB_OTG_DIEPCTL_EONUM_DPID          0x00010000U
#define USB_OTG_DIEPCTL_NAKSTS              0x00020000U
#define USB_OTG_DIEPCTL_EPTYP               0x000C0000U
#define USB_OTG_DIEPCTL_EPTYP_0             0x00040000U
#define USB_OTG_DIEPCTL_EPTYP_1             0x00080000U
#define USB_OTG_DIEPCTL_STALL               0x00200000U
#define USB_OTG_DIEPCTL_TXFNUM              0x03C00000U
#define USB_OTG_DIEPCTL_TXFNUM_0            0x00400000U
#define USB_OTG_DIEPCTL_TXFNUM_1            0x00800000U
#define USB_OTG_DIEPCTL_TXFNUM_2            0x01000000U
#define USB_OTG_DIEPCTL_TXFNUM_3            0x02000000U
#define USB_OTG_DIEPCTL_CNAK                0x04000000U
#define USB_OTG_DIEPCTL_SNAK                0x08000000U
#define USB_OTG_DIEPCTL_SD0PID_SEVNFRM      0x10000000U
#define USB_OTG_DIEPCTL_SODDFRM             0x20000000U
#define USB_OTG_DIEPCTL_EPDIS               0x40000000U
#define USB_OTG_DIEPCTL_EPENA               0x80000000U

// USB_OTG_HCCHAR register

#define USB_OTG_HCCHAR_MPSIZ                0x000007FFU
#define USB_OTG_HCCHAR_EPNUM                0x00007800U
#define USB_OTG_HCCHAR_EPNUM_0              0x00000800U
#define USB_OTG_HCCHAR_EPNUM_1              0x00001000U
#define USB_OTG_HCCHAR_EPNUM_2              0x00002000U
#define USB_OTG_HCCHAR_EPNUM_3              0x00004000U
#define USB_OTG_HCCHAR_EPDIR                0x00008000U
#define USB_OTG_HCCHAR_LSDEV                0x00020000U
#define USB_OTG_HCCHAR_EPTYP                0x000C0000U
#define USB_OTG_HCCHAR_EPTYP_0              0x00040000U
#define USB_OTG_HCCHAR_EPTYP_1              0x00080000U
#define USB_OTG_HCCHAR_MC                   0x00300000U
#define USB_OTG_HCCHAR_MC_0                 0x00100000U
#define USB_OTG_HCCHAR_MC_1                 0x00200000U
#define USB_OTG_HCCHAR_DAD                  0x1FC00000U
#define USB_OTG_HCCHAR_DAD_0                0x00400000U
#define USB_OTG_HCCHAR_DAD_1                0x00800000U
#define USB_OTG_HCCHAR_DAD_2                0x01000000U
#define USB_OTG_HCCHAR_DAD_3                0x02000000U
#define USB_OTG_HCCHAR_DAD_4                0x04000000U
#define USB_OTG_HCCHAR_DAD_5                0x08000000U
#define USB_OTG_HCCHAR_DAD_6                0x10000000U
#define USB_OTG_HCCHAR_ODDFRM               0x20000000U
#define USB_OTG_HCCHAR_CHDIS                0x40000000U
#define USB_OTG_HCCHAR_CHENA                0x80000000U

// USB_OTG_HCSPLT register

#define USB_OTG_HCSPLT_PRTADDR              0x0000007FU
#define USB_OTG_HCSPLT_PRTADDR_0            0x00000001U
#define USB_OTG_HCSPLT_PRTADDR_1            0x00000002U
#define USB_OTG_HCSPLT_PRTADDR_2            0x00000004U
#define USB_OTG_HCSPLT_PRTADDR_3            0x00000008U
#define USB_OTG_HCSPLT_PRTADDR_4            0x00000010U
#define USB_OTG_HCSPLT_PRTADDR_5            0x00000020U
#define USB_OTG_HCSPLT_PRTADDR_6            0x00000040U
#define USB_OTG_HCSPLT_HUBADDR              0x00003F80U
#define USB_OTG_HCSPLT_HUBADDR_0            0x00000080U
#define USB_OTG_HCSPLT_HUBADDR_1            0x00000100U
#define USB_OTG_HCSPLT_HUBADDR_2            0x00000200U
#define USB_OTG_HCSPLT_HUBADDR_3            0x00000400U
#define USB_OTG_HCSPLT_HUBADDR_4            0x00000800U
#define USB_OTG_HCSPLT_HUBADDR_5            0x00001000U
#define USB_OTG_HCSPLT_HUBADDR_6            0x00002000U
#define USB_OTG_HCSPLT_XACTPOS              0x0000C000U
#define USB_OTG_HCSPLT_XACTPOS_0            0x00004000U
#define USB_OTG_HCSPLT_XACTPOS_1            0x00008000U
#define USB_OTG_HCSPLT_COMPLSPLT            0x00010000U
#define USB_OTG_HCSPLT_SPLITEN              0x80000000U

// USB_OTG_HCINT register

