Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_usb.h
#define USB_OTG_HCINT_XFRC                  0x00000001U
#define USB_OTG_HCINT_CHH                   0x00000002U
#define USB_OTG_HCINT_AHBERR                0x00000004U
#define USB_OTG_HCINT_STALL                 0x00000008U
#define USB_OTG_HCINT_NAK                   0x00000010U
#define USB_OTG_HCINT_ACK                   0x00000020U
#define USB_OTG_HCINT_NYET                  0x00000040U
#define USB_OTG_HCINT_TXERR                 0x00000080U
#define USB_OTG_HCINT_BBERR                 0x00000100U
#define USB_OTG_HCINT_FRMOR                 0x00000200U
#define USB_OTG_HCINT_DTERR                 0x00000400U

// USB_OTG_DIEPINT register

#define USB_OTG_DIEPINT_XFRC                0x00000001U
#define USB_OTG_DIEPINT_EPDISD              0x00000002U
#define USB_OTG_DIEPINT_AHBERR              0x00000004U
#define USB_OTG_DIEPINT_TOC                 0x00000008U
#define USB_OTG_DIEPINT_ITTXFE              0x00000010U
#define USB_OTG_DIEPINT_INEPNM              0x00000020U
#define USB_OTG_DIEPINT_INEPNE              0x00000040U
#define USB_OTG_DIEPINT_TXFE                0x00000080U
#define USB_OTG_DIEPINT_TXFIFOUDRN          0x00000100U
#define USB_OTG_DIEPINT_BNA                 0x00000200U
#define USB_OTG_DIEPINT_PKTDRPSTS           0x00000800U
#define USB_OTG_DIEPINT_BERR                0x00001000U
#define USB_OTG_DIEPINT_NAK                 0x00002000U

// USB_OTG_HCINTMSK register

#define USB_OTG_HCINTMSK_XFRCM              0x00000001U
#define USB_OTG_HCINTMSK_CHHM               0x00000002U
#define USB_OTG_HCINTMSK_AHBERR             0x00000004U
#define USB_OTG_HCINTMSK_STALLM             0x00000008U
#define USB_OTG_HCINTMSK_NAKM               0x00000010U
#define USB_OTG_HCINTMSK_ACKM               0x00000020U
#define USB_OTG_HCINTMSK_NYET               0x00000040U
#define USB_OTG_HCINTMSK_TXERRM             0x00000080U
#define USB_OTG_HCINTMSK_BBERRM             0x00000100U
#define USB_OTG_HCINTMSK_FRMORM             0x00000200U
#define USB_OTG_HCINTMSK_DTERRM             0x00000400U

// USB_OTG_DIEPTSIZ register

#define USB_OTG_DIEPTSIZ_XFRSIZ             0x0007FFFFU
#define USB_OTG_DIEPTSIZ_PKTCNT             0x1FF80000U
#define USB_OTG_DIEPTSIZ_MULCNT             0x60000000U

// USB_OTG_HCTSIZ register

#define USB_OTG_HCTSIZ_XFRSIZ               0x0007FFFFU
#define USB_OTG_HCTSIZ_PKTCNT               0x1FF80000U
#define USB_OTG_HCTSIZ_DOPING               0x80000000U
#define USB_OTG_HCTSIZ_DPID                 0x60000000U
#define USB_OTG_HCTSIZ_DPID_0               0x20000000U
#define USB_OTG_HCTSIZ_DPID_1               0x40000000U

// USB_OTG_DIEPDMA register

#define USB_OTG_DIEPDMA_DMAADDR             0xFFFFFFFFU

// USB_OTG_HCDMA register

#define USB_OTG_HCDMA_DMAADDR               0xFFFFFFFFU

// USB_OTG_DTXFSTS register

#define USB_OTG_DTXFSTS_INEPTFSAV           0x0000FFFFU

// USB_OTG_DIEPTXF register

#define USB_OTG_DIEPTXF_INEPTXSA            0x0000FFFFU
#define USB_OTG_DIEPTXF_INEPTXFD            0xFFFF0000U

// USB_OTG_DOEPCTL register

#define USB_OTG_DOEPCTL_MPSIZ               0x000007FFU
#define USB_OTG_DOEPCTL_USBAEP              0x00008000U
#define USB_OTG_DOEPCTL_NAKSTS              0x00020000U
#define USB_OTG_DOEPCTL_SD0PID_SEVNFRM      0x10000000U
#define USB_OTG_DOEPCTL_SODDFRM             0x20000000U
#define USB_OTG_DOEPCTL_EPTYP               0x000C0000U
#define USB_OTG_DOEPCTL_EPTYP_0             0x00040000U
#define USB_OTG_DOEPCTL_EPTYP_1             0x00080000U
#define USB_OTG_DOEPCTL_SNPM                0x00100000U
#define USB_OTG_DOEPCTL_STALL               0x00200000U
#define USB_OTG_DOEPCTL_CNAK                0x04000000U
#define USB_OTG_DOEPCTL_SNAK                0x08000000U
#define USB_OTG_DOEPCTL_EPDIS               0x40000000U
#define USB_OTG_DOEPCTL_EPENA               0x80000000U

// USB_OTG_DOEPINT register

#define USB_OTG_DOEPINT_XFRC                0x00000001U
#define USB_OTG_DOEPINT_EPDISD              0x00000002U
#define USB_OTG_DOEPINT_AHBERR              0x00000004U
#define USB_OTG_DOEPINT_STUP                0x00000008U
#define USB_OTG_DOEPINT_OTEPDIS             0x00000010U
#define USB_OTG_DOEPINT_OTEPSPR             0x00000020U
#define USB_OTG_DOEPINT_B2BSTUP             0x00000040U
#define USB_OTG_DOEPINT_OUTPKTERR           0x00000100U
#define USB_OTG_DOEPINT_BERR                0x00001000U
#define USB_OTG_DOEPINT_NAK                 0x00002000U
#define USB_OTG_DOEPINT_NYET                0x00004000U
#define USB_OTG_DOEPINT_STPKTRX             0x00008000U

// USB_OTG_DOEPTSIZ register

#define USB_OTG_DOEPTSIZ_XFRSIZ             0x0007FFFFU
#define USB_OTG_DOEPTSIZ_PKTCNT             0x1FF80000U
#define USB_OTG_DOEPTSIZ_STUPCNT            0x60000000U
#define USB_OTG_DOEPTSIZ_STUPCNT_0          0x20000000U
#define USB_OTG_DOEPTSIZ_STUPCNT_1          0x40000000U

// PCGCCTL register

#define USB_OTG_PCGCCTL_STOPCLK             0x00000001U
#define USB_OTG_PCGCCTL_GATECLK             0x00000002U
#define USB_OTG_PCGCCTL_PHYSUSP             0x00000010U
